[
    {
      "word": "Lion",
      "definition": "A large, carnivorous feline known for its golden mane and often referred to as the 'king of the jungle.'"
    },
    {
      "word": "Elephant",
      "definition": "A large mammal with a trunk and tusks, known for its intelligence and social behavior."
    },
    {
      "word": "Dolphin",
      "definition": "A highly intelligent marine mammal known for its playful behavior and complex communication."
    },
    {
      "word": "Kangaroo",
      "definition": "A marsupial from Australia, known for its strong hind legs and ability to hop at high speeds."
    },
    {
      "word": "Penguin",
      "definition": "A flightless bird that lives in the Southern Hemisphere, particularly in Antarctica, and is known for its upright posture and swimming abilities."
    },
    {
      "word": "Giraffe",
      "definition": "The tallest land animal, known for its long neck and legs, typically found in Africa."
    },
    {
      "word": "Tiger",
      "definition": "A large, carnivorous feline with orange fur and black stripes, native to Asia."
    },
    {
      "word": "Zebra",
      "definition": "A herbivorous mammal with black-and-white striped fur, closely related to horses, native to Africa."
    },
    {
      "word": "Panda",
      "definition": "A bear species native to China, known for its black-and-white fur and primarily eating bamboo."
    },
    {
      "word": "Wolf",
      "definition": "A carnivorous mammal from the dog family, known for its pack behavior and howling."
    },
    {
      "word": "Eagle",
      "definition": "A large bird of prey with keen eyesight, known for its powerful flight and hunting abilities."
    },
    {
      "word": "Sloth",
      "definition": "A slow-moving mammal native to Central and South America, known for its long claws and spending most of its life hanging from trees."
    },
    {
      "word": "Octopus",
      "definition": "A marine animal with eight arms and high intelligence, known for its ability to change color and shape."
    },
    {
      "word": "Cheetah",
      "definition": "A large cat known for its incredible speed, capable of running faster than any other land animal."
    },
    {
      "word": "Bat",
      "definition": "A nocturnal mammal capable of flight, using echolocation to navigate in the dark."
    }
  ]
  